//Вам необходимо:
// 1. Клонировать репозиторий.
// 2. На основе ветки "Самостоятельная работа" создать свою 
// с названием Ср - ФИ.
// 3. В своей ветке вы создаёте код который выводит(список) и напротив каждой фамилии
// среднюю оценку(идентификатор) кажого студента (списка).
// 4. У каждого студента есть свой уникальный идентификатор,
// его вы получаете с учётом вашей средней оценки в прошлой дисциплине,
// каждому его номер индентификатора будет выслан в его ветку с номер в "теге".
// 5. Сумму всех необходимо вывести в конце программы, найти идентификаторы можно
// просмотрев историю веток.

//Список:
//Горожанкин Клим Максимович
//Еленский Евгений Владиславович
//Казаков Данила Дмитриевич
//Каширина Анастасия Игоревна
//Михайлова Екатерина Сергеевна
//Фролов Максим Романович
//Ширяев Александр Антонович
//Шлыков Денис Романович

// индентификаторы Горожанкин - q, Еленский - w, Казаков - e, Каширина - r, Михайлова - t, Фролов - y, Ширяев - u, Шлыков - i

double q = 11.9;
double w;
double e;
double r; 
double t;
double y;
double u;
double i;
Console.WriteLine($"Горожанкин Клим Максимович - {q}");
Console.WriteLine($"Горожанкин Клим Максимович - {w}");
Console.WriteLine($"Горожанкин Клим Максимович - {e}");
Console.WriteLine($"Горожанкин Клим Максимович - {r}");
Console.WriteLine($"Горожанкин Клим Максимович - {t}");
Console.WriteLine($"Горожанкин Клим Максимович - {y}");
Console.WriteLine($"Горожанкин Клим Максимович - {u}");
Console.WriteLine($"Горожанкин Клим Максимович - {i}");

