//Вам необходимо:
// 1. Клонировать репозиторий.
// 2. На основе ветки "Самостоятельная работа" создать свою 
// с названием Ср - ФИ.
// 3. В своей ветке вы создаёте код который выводит(список) и напротив каждой фамилии
// среднюю оценку(идентификатор) кажого студента (списка).
// 4. У каждого студента есть свой уникальный идентификатор,
// его вы получаете с учётом вашей средней оценки в прошлой дисциплине,
// каждому его номер индентификатора будет выслан в его ветку с номер в "теге".
// 5. Сумму всех необходимо вывести в конце программы, найти идентификаторы можно
// просмотрев историю веток.

//Список:
//Горожанкин Клим Максимович
//Еленский Евгений Владиславович
//Казаков Данила Дмитриевич
//Каширина Анастасия Игоревна
//Михайлова Екатерина Сергеевна
//Фролов Максим Романович
//Ширяев Александр Антонович
//Шлыков Денис Романович
double q = 11.9;
Console.WriteLine($"Горожанкин Клим Максимович - {q}");

// индентификаторы Горожанкин - q, Еленский - w, Казаков - e, Каширина - r, Михайлова - t, Фролов - y, Ширяев - u, Шлыков - i

double w = 2;
double e = 3;
double r = 4;
double t = 5;
double y = 6;
double u = 7;
double i = 8;

Console.WriteLine($"Еленский Евгений Владиславович - {w}");
Console.WriteLine($"Казаков Данила Дмитриевич - {e}");
Console.WriteLine($"Каширина Анастасия Игоревна - {r}");
Console.WriteLine($"Михайлова Екатерина Сергеевна - {t}");
Console.WriteLine($"Фролов Максим Романович - {y}");
Console.WriteLine($"Ширяев Александр Антонович - {u}");
Console.WriteLine($"Шлыков Денис Романович - {i}");

// Идентификатор - 11.4